#+TITLE: Project configuration
#+PROPERTY: header-args:emacs-lisp :results silent
#+PROPERTY: header-args:css :eval no
#+PROPERTY: header-args :cache no

*** Deleting unused rules

#+NAME: referenced-css-classes
#+BEGIN_SRC bash :results silent
find build/posts/ -name "*.html" -print0 | xargs -0 -I {} \
  perl -lne 'while ( /class="([^"]+)"/g ) { @classes = split(/\s+/, $1); print $_ foreach(@classes)}' {} | sort | uniq
#+END_SRC

Now we pare down the generated class definitions to only those that
were actually referenced from an HTML file.

#+NAME: generate-base-css
#+BEGIN_SRC perl :var css_classes=() input_file=css-temp-file :shebang #!/usr/bin/perl -l :results output
  use warnings;
  use strict;

  # highlighting whitespace looks weird since I have dark Emacs theme
  my @blacklist = ('org-highlight-indentation');

  my %classes = map { @$_[0] => 1 }  @$css_classes; # flatten array of arrays

  foreach my $cls (@blacklist) { delete $classes{$cls}; }

  open(my $fh, '<', $input_file) or die "Failed to get stylesheet: $!\n";
  while (<$fh>) {
      next if (/^\s*\.(.+) \{/ and not exists $classes{$1}) .. /\}/;
      print;
  }
  close $fh;
#+END_SRC

#+RESULTS: generate-base-css
#+begin_example
body {
  font-family: Palatino, Garamond, Baskerville, "Times New Roman", Serif;
}
#content {
  max-width:45em;
  margin:auto;
  padding:0 1em;
}
img {
  max-width:100%;
  max-height:100%;
}

/* BEGIN: Generated from faces */



      a {
        color: inherit;
        background-color: inherit;
        font: inherit;
        text-decoration: inherit;
      }
      a:hover {
        text-decoration: underline;
      }

/* END: Generated from faces */

/* BEGIN: Org-mode base css */
#postamble p, #preamble p { font-size: 90%; margin: .2em; }
p.verse { margin-left: 3%; }
ble { border-collapse:collapse; }
caption.t-above { caption-side: top; }
caption.t-bottom { caption-side: bottom; }
td, th { vertical-align:top;  }
th.org-right  { text-align: center;  }
th.org-left   { text-align: center;   }
th.org-center { text-align: center; }
td.org-right  { text-align: right;  }
td.org-left   { text-align: left;   }
td.org-center { text-align: center; }
dt { font-weight: bold; }
#org-div-home-and-up
 { text-align: right; font-size: 70%; white-space: nowrap; }
textarea { overflow-x: auto; }
#org-info-js_console-label
  { font-size: 10px; font-weight: bold; white-space: nowrap; }
.org-info-js_search-highlight
  { background-color: #ffff00; color: #000000; font-weight: bold; }
pre {
  border: 1px solid #ccc;
  padding: 8pt;
  font-family: monospace;
  overflow: auto;
  margin: 1.2em;
}
pre.example { box-shadow: 3px 3px 3px #eee; }
pre.src {
  position: relative;
  overflow: visible;
  padding-top: 1.2em;
}
pre.src:before {
  display: none;
  position: absolute;
  color: black;
  background-color: white;
  top: -10px;
  right: 10px;
  padding: 3px;
  border: 1px solid black;
}
pre.src:hover:before { display: inline;}
/* Languages per Org manual */
pre.src-clojure:before { content: 'Clojure'; }
pre.src-calc:before { content: 'Emacs Calc'; }
pre.src-emacs-lisp:before { content: 'Emacs Lisp'; }
pre.src-java:before { content: 'Java'; }
pre.src-latex:before { content: 'LaTeX'; }
pre.src-lisp:before { content: 'Lisp'; }
pre.src-org:before { content: 'Org mode'; }
pre.src-python:before { content: 'Python'; }
pre.src-R:before { content: 'R'; }
pre.src-ruby:before { content: 'Ruby'; }
pre.src-scheme:before { content: 'Scheme'; }
pre.src-sh:before { content: 'shell'; }
pre.src-sql:before { content: 'SQL'; }
pre.src-makefile:before { content: 'Makefile'; }
pre.src-perl:before { content: 'Perl'; }
pre.src-bash:before  { content: 'bash'; }

a { color: blue; }
a:visited { color: purple; }
a:hover { text-decoration: underline; }
/* END: Org-mode base css */
#+end_example

#+NAME: prettify-css
#+BEGIN_SRC emacs-lisp :var ugly-css="" output-file="/tmp/base.css"
  (with-temp-buffer
    (insert ugly-css)
    (css-mode)
    (indent-region (point-min) (point-max))
    (write-file output-file))
#+END_SRC

